---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.EdgeParameter
source: html/0388b3c1-6007-176a-40bf-fb0fd946a70e.htm
---
# Autodesk.Revit.DB.IntersectionResult.EdgeParameter Property

Parameter of a point on the edge closest to the point of intersection.

## Syntax (C#)
```csharp
public double EdgeParameter { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.